benchmarks/cospec_benchmark_results_20250521_021733_facebook/opt-13b_facebook/opt-350m_tp2_dtp2/baseline_7_0_20_natural-questions_output.txt
INFO 05-21 08:49:29 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8002, endpoint='/v1/completions', dataset_name='natural-questions', dataset_path=None, max_concurrency=None, model='facebook/opt-13b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=20.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 100228 samples from cache from sentence-transformers/cache/sharegpt_facebook/opt-13b.json
Temperature:  0.0
Checking server health at http://127.0.0.1:8002/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 20.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     3435      
Benchmark duration (s):                  300.23    
Total input tokens:                      39245     
Total generated tokens:                  460761    
Request throughput (req/s):              11.44     
Output token throughput (tok/s):         1534.71   
Total Token throughput (tok/s):          1665.43   
---------------Time to First Token----------------
Mean TTFT (ms):                          38841.87  
Median TTFT (ms):                        42590.46  
P99 TTFT (ms):                           64658.60  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          166.87    
Median TPOT (ms):                        149.63    
P99 TPOT (ms):                           337.60    
---------------Inter-token Latency----------------
Mean ITL (ms):                           757.81    
Median ITL (ms):                         722.42    
P99 ITL (ms):                            1038.83   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          59526.81  
Median E2EL (ms):                        63821.15  
P99 E2EL (ms):                           107546.06 
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 554.52    
Median Token Latency (ms):               470.65    
P99 Token Latency (ms):                  1948.22   
==================================================